[
  {
    "id": 1,
    "name": "Rumtek Monastery",
    "location": "Rumtek, East Sikkim",
    "established": "1740 (Original), 1966 (Present)",
    "imageName": "Rumtek-Monastery-1.webp",
    "latitude": 27.3539,
    "longitude": 88.6207,
    "history": "Rumtek Monastery is a gompa located in Rumtek village near Gangtok, Sikkim. The original monastery was built around 1740 by the 9th Karmapa. The present structure was inaugurated in 1966 by the 16th Karmapa and serves as the seat-in-exile of the Gyalwang Karmapa. Also known as the Dharmachakra Centre, it is one of the most significant monasteries of Tibetan Buddhism outside Tibet."
  },
  {
    "id": 2,
    "name": "Pemayangtse Monastery",
    "location": "Pelling, West Sikkim",
    "established": "1705",
    "imageName": "Pemangytse.webp",
    "latitude": 27.2051,
    "longitude": 88.2134,
    "history": "Pemayangtse Monastery is a Buddhist monastery in Pelling, Sikkim. Founded by Lama Lhatsun Chempo in 1705, it is one of the oldest and premier monasteries of Sikkim. The monastery follows the Nyingma order of Tibetan Buddhism and houses some of the most ancient Buddhist scriptures."
  },
  {
    "id": 3,
    "name": "Tashiding Monastery",
    "location": "Tashiding, West Sikkim",
    "established": "1641",
    "imageName": "Tashiding-Monastery.webp",
    "latitude": 27.3372,
    "longitude": 88.2714,
    "history": "Tashiding Monastery is a Buddhist monastery of the Nyingma sect of Tibetan Buddhism in Western Sikkim. It is located on top of a hill between the Rathong Chu and the Rangeet River. The monastery is considered sacred by Buddhists and is famous for its holy water and the annual Bhumchu festival."
  },
  {
    "id": 4,
    "name": "Enchey Monastery",
    "location": "Gangtok, East Sikkim",
    "established": "1840",
    "imageName": "Enchey Monastery.webp",
    "latitude": 27.3408,
    "longitude": 88.6200,
    "history": "Enchey Monastery was established in 1840 by Lama Druptob Karpo, who belonged to the Nyingma order of Vajrayana Buddhism. Built on the site blessed by Lama Druptob Karpo, the monastery is famous for its annual Chaam dance performed by monks during the Chaam festival."
  },
  {
    "id": 5,
    "name": "Dubdi Monastery",
    "location": "Yuksom, West Sikkim",
    "established": "1701",
    "imageName": "Dubdi Monastery.webp",
    "latitude": 27.3667,
    "longitude": 88.2167,
    "history": "Dubdi Monastery, also known as Hermit's Cell, is a Buddhist monastery of the Nyingma sect. It is the oldest monastery in Sikkim, established in 1701 by Chogyal Namgyal along with Lama Lhatsun Chenpo. The monastery is situated on a hilltop and offers panoramic views of the surrounding mountains."
  },
  {
    "id": 6,
    "name": "Phodong Monastery",
    "location": "Phodong, North Sikkim",
    "established": "1721",
    "imageName": "Phodong-Monastery.webp",
    "latitude": 27.4833,
    "longitude": 88.7167,
    "history": "Phodong Monastery is one of the most beautiful monasteries in Sikkim, established in 1721 and rebuilt in 1947. It belongs to the Kagyupa sect and is known for its impressive architecture and the annual festival of Losoong. The monastery houses about 260 monks and is famous for its butter sculptures."
  },
  {
    "id": 7,
    "name": "Ralang Monastery",
    "location": "Ralang, West Sikkim",
    "established": "1730 (Old), 1995 (New)",
    "imageName": "Ralang-Monastery.webp",
    "latitude": 27.2833,
    "longitude": 88.5500,
    "history": "Ralang Monastery, also known as Ralung Monastery, was originally built around 1730 by the fourth Chogyal Gyurmed Namgyal after his pilgrimage to Tibet. The New Ralang Monastery (Palchen Choeling) was established in 1995. The monastery belongs to the Kagyupa sect and is famous for the Pang Lhabsol festival and its sacred artifacts."
  },
  {
    "id": 8,
    "name": "Tsuklakhang Gonpa",
    "location": "Gangtok, East Sikkim",
    "established": "1894",
    "imageName": "Tsuklakhang-Gonpa.webp",
    "latitude": 27.3333,
    "longitude": 88.6167,
    "history": "Tsuklakhang Gonpa, also known as the Royal Chapel, is the main monastery in Gangtok. Built in 1894 during the reign of Thutob Namgyal, it served as the royal chapel of the Chogyals and contains a large collection of scriptures and religious artifacts. The monastery is an important center for Buddhist learning and meditation."
  },
  {
    "id": 9,
    "name": "Kathog Lake Monastery",
    "location": "Pakyong, East Sikkim",
    "established": "2000",
    "imageName": "Kathog.webp",
    "latitude": 27.2167,
    "longitude": 88.5833,
    "history": "Kathog Lake Monastery is a relatively new but spiritually significant monastery built near the sacred Kathog Lake. While the present monastery was built around 2000, the lake itself has been revered for centuries and is believed to possess healing properties. The monastery follows the Nyingma tradition and is known for its peaceful environment and meditation retreats."
  },
  {
    "id": 10,
    "name": "Lingdum Zurmang Monastery",
    "location": "Ranka, East Sikkim",
    "established": "1999",
    "imageName": "Lingdum-Zurmang.webp",
    "latitude": 27.2833,
    "longitude": 88.5167,
    "history": "Lingdum Zurmang Monastery is a modern monastery that follows the Zurmang Kagyu tradition of Tibetan Buddhism. Established in 1999, it is known for its beautiful architecture blending traditional Tibetan design with modern elements. The monastery is a center for Buddhist studies and meditation practices."
  },
  {
    "id": 11,
    "name": "Bumtar Namdroling Monastery",
    "location": "Bumtar, South Sikkim",
    "established": "1939",
    "imageName": "Bumtar Namdroling Monastery1.jpg",
    "latitude": 27.3000,
    "longitude": 88.6000,
    "history": "Bumtar Namdroling Monastery is a vibrant Buddhist monastery located in Bumtar, South Sikkim. Established in 1939, it is known for its beautiful murals, peaceful surroundings, and annual religious festivals. The monastery is a center for spiritual learning and community gatherings."
  },
  {
    "id": 12,
    "name": "Doling Monastery",
    "location": "Doling, South Sikkim",
    "established": "1760",
    "imageName": "Doling-Monastery1.jpg",
    "latitude": 27.2300,
    "longitude": 88.4200,
    "history": "Doling Monastery is a historic Buddhist monastery located in South Sikkim. Built around 1760, it is known for its serene environment and beautiful architecture. It is an important spiritual center for the local community and hosts several annual festivals and rituals."
  },
  {
    "id": 13,
    "name": "Karma Raptenling Monastery",
    "location": "South Sikkim",
    "established": "1960",
    "imageName": "Karma-Raptenling-Monastery1.jpg",
    "latitude": 27.2500,
    "longitude": 88.4100,
    "history": "Karma Raptenling Monastery is a prominent monastery in South Sikkim, founded around 1960. It is known for its vibrant community and traditional Buddhist practices. The monastery is a center for learning and meditation, attracting visitors and devotees from across the region."
  },
  {
    "id": 14,
    "name": "Ngadag Monastery",
    "location": "South Sikkim",
    "established": "1690",
    "imageName": "Ngadag-Monastery1.jpg",
    "latitude": 27.2400,
    "longitude": 88.4300,
    "history": "Ngadag Monastery, originally built around 1690 by the Chogyals of Sikkim, is one of the oldest monasteries in South Sikkim. It was initially constructed as a palace and later converted into a monastery. A newer structure was built later to withstand earthquakes. It is renowned for its spiritual ambiance, beautiful surroundings, and annual religious ceremonies."
  }
]
