[
  {
    "id": 1,
    "name": "Rumtek Monastery",
    "location": "Rumtek, East Sikkim",
    "established": "1740 (Original), 1966 (Present)",
    "imageName": "Old-Rumtek-Monastery1.png",
    "latitude": 27.3539,
    "longitude": 88.6207,
    "history": "Rumtek Monastery is a gompa located in Rumtek village near Gangtok, Sikkim. The original monastery (Old Rumtek) was built around 1740 by the 9th Karmapa Wangchuk Dorje and holds immense historical significance in Sikkim's Buddhist heritage. It served as the primary seat of the Karmapa lineage in Sikkim for over two centuries. The present structure was inaugurated in 1966 by the 16th Karmapa and serves as the seat-in-exile of the Gyalwang Karmapa. Also known as the Dharmachakra Centre, it is one of the most significant monasteries of Tibetan Buddhism outside Tibet. The Old Rumtek Monastery, though smaller than its modern counterpart, retains its unique charm with ancient murals, sacred relics, and a deeply spiritual atmosphere, continuing to be an important pilgrimage site and meditation center."
  },
  {
    "id": 2,
    "name": "Pemayangtse Monastery",
    "location": "Pelling, West Sikkim",
    "established": "1705",
    "imageName": "Pemangytse.webp",
    "latitude": 27.2051,
    "longitude": 88.2134,
    "history": "Pemayangtse Monastery is a Buddhist monastery in Pelling, Sikkim. Founded by Lama Lhatsun Chempo in 1705, it is one of the oldest and premier monasteries of Sikkim. The monastery follows the Nyingma order of Tibetan Buddhism and houses some of the most ancient Buddhist scriptures."
  },
  {
    "id": 3,
    "name": "Tashiding Monastery",
    "location": "Tashiding, West Sikkim",
    "established": "1641",
    "imageName": "Tashiding-Monastery.webp",
    "latitude": 27.3372,
    "longitude": 88.2714,
    "history": "Tashiding Monastery is a Buddhist monastery of the Nyingma sect of Tibetan Buddhism in Western Sikkim. It is located on top of a hill between the Rathong Chu and the Rangeet River. The monastery is considered sacred by Buddhists and is famous for its holy water and the annual Bhumchu festival."
  },
  {
    "id": 4,
    "name": "Dubdi Monastery",
    "location": "Yuksom, West Sikkim",
    "established": "1701",
    "imageName": "Dubdi Monastery.webp",
    "latitude": 27.3667,
    "longitude": 88.2167,
    "history": "Dubdi Monastery, also known as Hermit's Cell, is a Buddhist monastery of the Nyingma sect. It is the oldest monastery in Sikkim, established in 1701 by Chogyal Namgyal along with Lama Lhatsun Chenpo. The monastery is situated on a hilltop and offers panoramic views of the surrounding mountains."
  },
  {
    "id": 5,
    "name": "Ralang Monastery",
    "location": "Ralang, South Sikkim",
    "established": "1730 (Old), 1995 (New)",
    "imageName": "Ralang-Monastery.webp",
    "latitude": 27.2833,
    "longitude": 88.5500,
    "history": "Ralang Monastery, also known as Ralung Monastery, was originally built around 1730 by the fourth Chogyal Gyurmed Namgyal after his pilgrimage to Tibet. The New Ralang Monastery (Palchen Choeling) was established in 1995. The monastery belongs to the Kagyupa sect and is famous for the Pang Lhabsol festival and its sacred artifacts."
  },
  {
    "id": 6,
    "name": "Kathog Lake Monastery",
    "location": "Yuksom, West Sikkim",
    "established": "2000",
    "imageName": "Kathog.webp",
    "latitude": 27.3667,
    "longitude": 88.2333,
    "history": "Kathog Lake Monastery, also known as Kathog Dorjeden Monastery, is a spiritually significant monastery built near the sacred Kathog Lake in Yuksom. While the present monastery was established around 2000, the lake itself has been revered for centuries and is believed to possess healing properties. Named after the ancient Kathog lineage, one of the six main monasteries of the Nyingma school, it maintains the sacred traditions of Tibetan Buddhism. The monastery is known for its peaceful environment, beautiful architecture, and serves as a center for meditation retreats and Buddhist studies."
  },
  {
    "id": 7,
    "name": "Lingdum Zurmang Monastery",
    "location": "Ranka, East Sikkim",
    "established": "1999",
    "imageName": "Lingdum-Zurmang.webp",
    "latitude": 27.2833,
    "longitude": 88.5167,
    "history": "Lingdum Zurmang Monastery is a modern monastery that follows the Zurmang Kagyu tradition of Tibetan Buddhism. Established in 1999, it is known for its beautiful architecture blending traditional Tibetan design with modern elements. The monastery is a center for Buddhist studies and meditation practices."
  },
  {
    "id": 8,
    "name": "Bumtar Namdroling Monastery",
    "location": "Bumtar, South Sikkim",
    "established": "1939",
    "imageName": "Bumtar Namdroling Monastery1.jpg",
    "latitude": 27.3000,
    "longitude": 88.6000,
    "history": "Bumtar Namdroling Monastery is a vibrant Buddhist monastery located in Bumtar, South Sikkim. Established in 1939, it is known for its beautiful murals, peaceful surroundings, and annual religious festivals. The monastery is a center for spiritual learning and community gatherings."
  },
  {
    "id": 9,
    "name": "Doling Monastery",
    "location": "Doling, South Sikkim",
    "established": "1760",
    "imageName": "Doling-Monastery1.jpg",
    "latitude": 27.2300,
    "longitude": 88.4200,
    "history": "Doling Monastery is a historic Buddhist monastery located in South Sikkim. Built around 1760, it is known for its serene environment and beautiful architecture. It is an important spiritual center for the local community and hosts several annual festivals and rituals."
  },
  {
    "id": 10,
    "name": "Karma Raptenling Monastery",
    "location": "South Sikkim",
    "established": "1960",
    "imageName": "Karma-Raptenling-Monastery1.jpg",
    "latitude": 27.2500,
    "longitude": 88.4100,
    "history": "Karma Raptenling Monastery is a prominent monastery in South Sikkim, founded around 1960. It is known for its vibrant community and traditional Buddhist practices. The monastery is a center for learning and meditation, attracting visitors and devotees from across the region."
  },
  {
    "id": 11,
    "name": "Ngadag Monastery",
    "location": "South Sikkim",
    "established": "1690",
    "imageName": "Ngadag-Monastery1.jpg",
    "latitude": 27.2400,
    "longitude": 88.4300,
    "history": "Ngadag Monastery, originally built around 1690 by the Chogyals of Sikkim, is one of the oldest monasteries in South Sikkim. It was initially constructed as a palace and later converted into a monastery. A newer structure was built later to withstand earthquakes. It is renowned for its spiritual ambiance, beautiful surroundings, and annual religious ceremonies."
  },
  {
    "id": 12,
    "name": "Aden Wolung Monastery",
    "location": "Aden Wolung, West Sikkim",
    "established": "1860",
    "imageName": "ADEN WOLUNG.jfif",
    "latitude": 27.2800,
    "longitude": 88.1800,
    "history": "Aden Wolung Monastery is a sacred Buddhist monastery located in West Sikkim, established around 1860. Known for its serene mountain setting and traditional architecture, the monastery serves as an important spiritual center for the local community. It follows the Nyingma tradition and is famous for its annual festivals and meditation retreats."
  },
  {
    "id": 13,
    "name": "Chakung Monastery",
    "location": "Chakung, West Sikkim",
    "established": "1750",
    "imageName": "CHAKUNG.jfif",
    "latitude": 27.2600,
    "longitude": 88.1600,
    "history": "Chakung Monastery, founded around 1750, is one of the historic monasteries of West Sikkim. The monastery is known for its beautiful location amidst the Himalayan foothills and its rich collection of religious artifacts. It serves as a center for Buddhist learning and community gatherings, maintaining the ancient traditions of Tibetan Buddhism."
  },
  {
    "id": 14,
    "name": "Dodak Tamu Monastery",
    "location": "Dodak Tamu, West Sikkim",
    "established": "1680",
    "imageName": "DODAK TAMU.jfif",
    "latitude": 27.3100,
    "longitude": 88.1900,
    "history": "Dodak Tamu Monastery is one of the oldest monasteries in West Sikkim, established around 1680. The monastery is renowned for its ancient Buddhist scriptures and traditional architecture. It has been a significant center for spiritual learning and meditation practices, attracting pilgrims and scholars from across the Himalayan region."
  },
  {
    "id": 15,
    "name": "Druk Monastery",
    "location": "Druk, West Sikkim",
    "established": "1700",
    "imageName": "Druk.jfif",
    "latitude": 27.2900,
    "longitude": 88.2100,
    "history": "Druk Monastery, founded around 1700, is a prominent monastery in West Sikkim known for its peaceful atmosphere and stunning mountain views. The monastery follows the Drukpa Kagyu tradition and is famous for its annual Cham dance performances and religious ceremonies. It serves as an important pilgrimage site for Buddhist devotees."
  },
  {
    "id": 16,
    "name": "Hungri Monastery",
    "location": "Hungri, West Sikkim",
    "established": "1840",
    "imageName": "HUNGRI.jpg",
    "latitude": 27.2700,
    "longitude": 88.1700,
    "history": "Hungri Monastery, established around 1840, is a sacred Buddhist monastery nestled in the hills of West Sikkim. The monastery is known for its traditional Tibetan architecture and serves as a center for Buddhist meditation and religious studies. It plays a vital role in preserving the cultural heritage of the region."
  },
  {
    "id": 17,
    "name": "Khachoedpalri Monastery",
    "location": "Khachoedpalri, West Sikkim",
    "established": "1700",
    "imageName": "KHACHOEDPALRI.jpg",
    "latitude": 27.3200,
    "longitude": 88.1500,
    "history": "Khachoedpalri Monastery is located near the sacred Khachoedpalri Lake, established around 1700. The monastery is considered one of the most sacred sites in Sikkim, where it is believed that the wishes of devotees are fulfilled. The monastery and the nearby wish-fulfilling lake are important pilgrimage destinations for Buddhists and Hindus alike."
  },
  {
    "id": 18,
    "name": "Lhuntse Monastery",
    "location": "Lhuntse, West Sikkim",
    "established": "1720",
    "imageName": "LHUNTSE.jfif",
    "latitude": 27.2500,
    "longitude": 88.1400,
    "history": "Lhuntse Monastery, founded around 1720, is a historic monastery in West Sikkim known for its beautiful murals and ancient Buddhist texts. The monastery follows the Nyingma tradition and is famous for its spiritual retreats and meditation programs. It has been a center of Buddhist learning for over three centuries."
  },
  {
    "id": 19,
    "name": "Melli-Atsing Monastery",
    "location": "Melli-Atsing, West Sikkim",
    "established": "1850",
    "imageName": "MELLI-ATSING.jfif",
    "latitude": 27.2400,
    "longitude": 88.1300,
    "history": "Melli-Atsing Monastery, established around 1850, is a peaceful monastery located in the lower regions of West Sikkim. The monastery is known for its community-oriented approach and serves as a center for local religious activities. It plays an important role in preserving Buddhist traditions and providing spiritual guidance to the local community."
  },
  {
    "id": 20,
    "name": "Nubling Monastery",
    "location": "Nubling, West Sikkim",
    "established": "1860",
    "imageName": "NUBLING1.jfif",
    "latitude": 27.2200,
    "longitude": 88.1200,
    "history": "Nubling Monastery, founded around 1860, is a traditional Buddhist monastery situated in the scenic landscape of West Sikkim. The monastery is known for its ancient architecture and serves as a spiritual sanctuary for meditation and prayer. It continues to maintain the rich Buddhist heritage of the region."
  },
  {
    "id": 21,
    "name": "Okhery Monastery",
    "location": "Okhery, West Sikkim",
    "established": "1880",
    "imageName": "OKHERY1.jfif",
    "latitude": 27.3300,
    "longitude": 88.2000,
    "history": "Okhery Monastery, established around 1880, is a serene monastery located in the hills of West Sikkim. The monastery is known for its traditional Tibetan Buddhist practices and beautiful mountain setting. It serves as a center for religious studies and spiritual development, attracting visitors seeking peace and enlightenment."
  },
  {
    "id": 22,
    "name": "Pegmantysse Monastery",
    "location": "Pegmantysse, West Sikkim",
    "established": "1900",
    "imageName": "pegmantysse1.jfif",
    "latitude": 27.2300,
    "longitude": 88.1100,
    "history": "Pegmantysse Monastery, founded around 1900, is a relatively modern monastery that has quickly become an important spiritual center in West Sikkim. The monastery is known for its active community involvement and traditional Buddhist teachings. It serves as a bridge between ancient Buddhist wisdom and contemporary spiritual needs."
  },
  {
    "id": 23,
    "name": "Rinchen Choling Monastery",
    "location": "Rinchen Choling, West Sikkim",
    "established": "1840",
    "imageName": "RINCHEN CHOLING.jfif",
    "latitude": 27.2600,
    "longitude": 88.1800,
    "history": "Rinchen Choling Monastery, established around 1840, is a precious jewel among the monasteries of West Sikkim. The name 'Rinchen Choling' means 'Precious Dharma Place,' and it lives up to its name by being a center of Buddhist learning and spiritual practice. The monastery is known for its beautiful architecture and religious festivals."
  },
  {
    "id": 24,
    "name": "Rinchenpung Monastery",
    "location": "Rinchenpung, West Sikkim",
    "established": "1890",
    "imageName": "RINCHENPUNG1.jfif",
    "latitude": 27.2800,
    "longitude": 88.1900,
    "history": "Rinchenpung Monastery, founded around 1890, is a historic monastery known for its strategic location and spiritual significance. The monastery has been a guardian of Buddhist traditions and serves as a center for religious ceremonies and festivals. It is particularly famous for its annual celebrations and traditional mask dances."
  },
  {
    "id": 25,
    "name": "Sinon Monastery",
    "location": "Sinon, West Sikkim",
    "established": "1920",
    "imageName": "Sinon.png",
    "latitude": 27.3000,
    "longitude": 88.2200,
    "history": "Sinon Monastery, established around 1920, is one of the more recent additions to the monastic heritage of West Sikkim. Despite its relatively recent establishment, the monastery has become an important center for Buddhist practice and community activities. It is known for its modern approach to traditional Buddhist teachings."
  },
  {
    "id": 26,
    "name": "Sri Badam Monastery",
    "location": "Sri Badam, West Sikkim",
    "established": "1870",
    "imageName": "SRI BADAM.jpg",
    "latitude": 27.2700,
    "longitude": 88.1600,
    "history": "Sri Badam Monastery, founded around 1870, is a peaceful monastery located in the serene environment of West Sikkim. The monastery is known for its dedication to preserving Buddhist scriptures and providing spiritual education. It serves as a center for meditation retreats and religious studies, attracting scholars and practitioners from various regions."
  },
  {
    "id": 27,
    "name": "Tashi Samboling Monastery",
    "location": "Tashi Samboling, West Sikkim",
    "established": "1830",
    "imageName": "TASHI SAMBOLING.jfif",
    "latitude": 27.2900,
    "longitude": 88.2000,
    "history": "Tashi Samboling Monastery, established around 1830, is an auspicious monastery whose name means 'Place of Good Fortune and Complete Liberation.' The monastery is renowned for its spiritual atmosphere and traditional Buddhist practices. It serves as a center for religious festivals, meditation programs, and Buddhist philosophy studies."
  },
  {
    "id": 28,
    "name": "Enchey Monastery",
    "location": "Gangtok, East Sikkim",
    "established": "1840",
    "imageName": "Enchey-Monastery1.png",
    "latitude": 27.3408,
    "longitude": 88.6200,
    "history": "Enchey Monastery, established in 1840 by Lama Druptob Karpo of the Nyingma order, is one of the most important monasteries in Gangtok. The name 'Enchey' means 'solitary temple.' Built on a site blessed by Lama Druptob Karpo, who is believed to have the power to fly, the monastery commands a panoramic view of the Kanchenjunga range. It is famous for its annual Chaam dance performed during the Chaam festival in December or January."
  },
  {
    "id": 29,
    "name": "Lingdok Tsangkhar Monastery",
    "location": "Lingdok, East Sikkim",
    "established": "1850",
    "imageName": "Lingdok-Tsangkhar-Monastery1.jpg",
    "latitude": 27.3150,
    "longitude": 88.5950,
    "history": "Lingdok Tsangkhar Monastery, founded around 1850, is a historic monastery nestled in the scenic hills of East Sikkim. The monastery follows the Nyingma tradition and is renowned for its ancient Buddhist scriptures and sacred relics. 'Tsangkhar' means 'white house' in Tibetan, reflecting the monastery's pristine white architecture. It serves as an important spiritual center for the local community, hosting annual religious ceremonies and providing Buddhist education to monks and devotees."
  },
  {
    "id": 30,
    "name": "Linkoed Monastery",
    "location": "Rhenock, East Sikkim",
    "established": "1890",
    "imageName": "Linkoed-Monastery1.png",
    "latitude": 27.2450,
    "longitude": 88.5650,
    "history": "Linkoed Monastery, established around 1890, is a hidden gem in the lower regions of East Sikkim. The monastery is known for its tranquil setting amidst lush green forests and terraced fields. Following the Kagyu tradition of Tibetan Buddhism, it has been a guardian of Buddhist teachings for over a century. The monastery features traditional Sikkimese architecture and houses ancient murals and thangkas. It plays a vital role in preserving the cultural and spiritual heritage of the region."
  },
  {
    "id": 31,
    "name": "Pabyuk Monastery",
    "location": "Pakyong, East Sikkim",
    "established": "1880",
    "imageName": "Pabyuk-Monastery1.png",
    "latitude": 27.2250,
    "longitude": 88.5750,
    "history": "Pabyuk Monastery, founded around 1880, is a serene monastery located in the picturesque Pakyong region of East Sikkim. The monastery belongs to the Kagyu sect and is known for its beautiful location overlooking valleys and mountains. 'Pabyuk' in the local language refers to the unique geographical features of the area. The monastery serves as a center for Buddhist learning, meditation practices, and hosts several annual festivals that attract devotees from across Sikkim."
  },
  {
    "id": 32,
    "name": "Ray Mindu Katenling Monastery",
    "location": "Martam, East Sikkim",
    "established": "1870",
    "imageName": "Ray-Mindu-Katenling-Monastery1.png",
    "latitude": 27.2850,
    "longitude": 88.5550,
    "history": "Ray Mindu Katenling Monastery, established around 1870, is a prominent monastery in the Martam area of East Sikkim. The monastery's name reflects its association with spiritual enlightenment and Buddhist teachings. It follows the Nyingma tradition and is particularly known for its collection of rare Buddhist texts and artifacts. The monastery has been instrumental in spreading Buddhist education in the region and continues to serve as an important center for religious ceremonies, meditation retreats, and community gatherings."
  },
  {
    "id": 33,
    "name": "Labrang Monastery",
    "location": "Labrang, East Sikkim",
    "established": "1814",
    "imageName": "LABRANG MONASTEY 1.jpg",
    "latitude": 27.3100,
    "longitude": 88.5800,
    "history": "Labrang Monastery, established around 1814, is a significant Buddhist monastery in East Sikkim. Named after the famous Labrang Monastery in Tibet, it follows the Gelug tradition of Tibetan Buddhism. The monastery is known for its beautiful architecture featuring traditional Tibetan designs and serves as an important center for Buddhist philosophy and monastic education. It houses a valuable collection of Buddhist texts, thangkas, and ritual objects. The monastery plays a vital role in preserving the spiritual and cultural heritage of the region."
  },
  {
    "id": 34,
    "name": "Lachen Ngodub Choling Monastery",
    "location": "Lachen, North Sikkim",
    "established": "1858",
    "imageName": "LACHEN NGODUB CHOLING MONASTERY 1.jpg",
    "latitude": 27.6950,
    "longitude": 88.5450,
    "history": "Lachen Ngodub Choling Monastery, founded around 1858, is one of the most important monasteries in North Sikkim. Located in the picturesque village of Lachen at an altitude of about 2,750 meters, the monastery belongs to the Nyingma order. 'Ngodub Choling' means 'Monastery of the Accomplished Ones,' reflecting its spiritual significance. The monastery is renowned for its annual Guru Rinpoche festival and serves as a spiritual beacon for the local Bhutia community. It features beautiful murals and houses sacred relics passed down through generations."
  },
  {
    "id": 35,
    "name": "Lachen Thangu Monastery",
    "location": "Thangu Valley, North Sikkim",
    "established": "1880",
    "imageName": "LACHEN THANGU MONASTERY 1.jpg",
    "latitude": 27.7500,
    "longitude": 88.5800,
    "history": "Lachen Thangu Monastery, established around 1880, is situated in the remote and breathtakingly beautiful Thangu Valley near the Indo-China border. At an altitude of approximately 3,962 meters, it is one of the highest monasteries in Sikkim. The monastery follows the Nyingma tradition and serves the spiritual needs of the nomadic yak herders and local communities in this high-altitude region. Despite its remote location, the monastery maintains strong Buddhist traditions and is known for its resilience against harsh Himalayan winters."
  },
  {
    "id": 36,
    "name": "Lingthem Gonpa Chophel Dargyeling",
    "location": "Lingthem, East Sikkim",
    "established": "1862",
    "imageName": "LINGTHEM GONPA CHOPHEL DARGYELING 1.jpg",
    "latitude": 27.3300,
    "longitude": 88.5650,
    "history": "Lingthem Gonpa Chophel Dargyeling, founded around 1862, is a historically significant monastery in East Sikkim. The name 'Chophel Dargyeling' translates to 'Place Where Dharma Flourishes and Spreads.' This monastery belongs to the Nyingma sect and is known for its extensive library of Buddhist scriptures and ancient manuscripts. The monastery has been a center for religious learning and meditation practices for over 160 years. It features magnificent wall paintings depicting the life of Buddha and various Buddhist deities, and continues to be an important pilgrimage site for devotees."
  },
  {
    "id": 37,
    "name": "Phensang Monastery",
    "location": "Phensang, North Sikkim",
    "established": "1840",
    "imageName": "Phensang Monastery 1.jpg",
    "latitude": 27.2950,
    "longitude": 88.5750,
    "history": "Phensang Monastery, established around 1840, is a serene monastery known for its peaceful setting amidst the lush forests of North Sikkim. The monastery follows the Kagyu tradition and has been a center for Buddhist meditation and spiritual practices for nearly two centuries. Phensang Monastery is particularly renowned for its three-year retreat program, where monks undergo intensive meditation training in complete isolation. The monastery features traditional Sikkimese architecture with beautifully painted woodwork and houses several sacred Buddhist texts and artifacts."
  },
  {
    "id": 38,
    "name": "Phodong Karma Tashi Chokhorling Monastery",
    "location": "Phodong, North Sikkim",
    "established": "1740",
    "imageName": "PHODONG KARMA TASHI CHOKHORLING MONASTERY 1.jpg",
    "latitude": 27.4850,
    "longitude": 88.7180,
    "history": "Phodong Karma Tashi Chokhorling Monastery, originally established around 1740 and rebuilt in 1947, is one of the most beautiful and spiritually significant monasteries in North Sikkim. The name 'Tashi Chokhorling' means 'Auspicious Dharma Wheel Place.' Belonging to the Kagyupa sect, the monastery can accommodate about 260 monks and is famous for its annual Losar (Tibetan New Year) celebrations and Chaam dances. The monastery is renowned for its elaborate butter sculptures (tormas), ancient thangkas, and a magnificent collection of Buddhist scriptures. Its architecture showcases classic Tibetan style with intricate woodwork and colorful murals."
  },
  {
    "id": 39,
    "name": "Silem Phagyal Tashi Dargyeling Monastery",
    "location": "Silem, South Sikkim",
    "established": "1850",
    "imageName": "SILEM PHAGYAL TASHI DARGYELING MONASTERY 1.jpg",
    "latitude": 27.1800,
    "longitude": 88.4800,
    "history": "Silem Phagyal Tashi Dargyeling Monastery, founded around 1850, is a prominent monastery in South Sikkim. 'Phagyal Tashi Dargyeling' translates to 'The Auspicious and Victorious Place of Dharma Spreading.' This monastery follows the Nyingma tradition and is known for its annual Pang Lhabsol festival, which celebrates the guardian deities of Sikkim. The monastery sits at a strategic location offering panoramic views of the surrounding valleys and is famous for its medicinal plant garden. It serves as an important center for Buddhist philosophy studies and traditional Tibetan medicine."
  },
  {
    "id": 40,
    "name": "Singchit Ngadag Monastery",
    "location": "Singchit, North Sikkim",
    "established": "1820",
    "imageName": "SINGCHIT NGADAG MONASTERY 1.jpg",
    "latitude": 27.2400,
    "longitude": 88.5500,
    "history": "Singchit Ngadag Monastery, established around 1820, is a historic monastery located in the Singchit region of North Sikkim. 'Ngadag' refers to the local guardian deity, and the monastery is believed to protect and bless the surrounding villages. Belonging to the Kagyu sect, this monastery is known for its unique architectural style that blends traditional Tibetan and Sikkimese elements. The monastery houses ancient Buddhist scriptures, prayer wheels, and sacred artifacts. It plays a crucial role in preserving local Buddhist traditions and hosts several annual religious festivals that bring together the community."
  },
  {
    "id": 41,
    "name": "Tholung Monastery",
    "location": "Tholung Valley, North Sikkim",
    "established": "1765",
    "imageName": "THOLUNG MONASTERY 1.jpg",
    "latitude": 27.6500,
    "longitude": 88.6200,
    "history": "Tholung Monastery, established around 1765, is one of the oldest and most sacred monasteries in North Sikkim. Located in the mystical Tholung Valley, which is considered one of the hidden valleys (beyul) in Tibetan Buddhism, the monastery belongs to the Nyingma order. The name 'Tholung' means 'Valley of the Head,' as legend says that the valley resembles the shape of a horse's head. The monastery was blessed by Guru Padmasambhava and is surrounded by numerous meditation caves used by ancient Buddhist masters. It is particularly famous for its sacred hot springs and annual Kagyed dance festival. The monastery serves as a gateway to many high-altitude pilgrimage sites."
  },
  {
    "id": 42,
    "name": "Tingbung Monastery",
    "location": "Tingbung, East Sikkim",
    "established": "1835",
    "imageName": "TINGBUNG MONASTERY 1.jpg",
    "latitude": 27.2650,
    "longitude": 88.5650,
    "history": "Tingbung Monastery, founded around 1835, is a beautiful monastery situated in the tranquil Tingbung area of East Sikkim. The monastery follows the Nyingma tradition and is known for its peaceful environment ideal for meditation and spiritual contemplation. It features traditional Sikkimese architecture with intricately carved wooden pillars and colorfully painted walls depicting Buddhist legends. The monastery houses a valuable collection of ancient Buddhist texts and ritual instruments. Tingbung Monastery is particularly renowned for its annual Mahakala puja (prayer ceremony) and serves as an important spiritual center for surrounding villages, maintaining strong connections with the local community."
  }
]
